export default {
  projections: {
    КурсE: {
      iD: {
        __caption__: 'ID'
      },
      название: {
        __caption__: 'Название'
      },
      преподаватель: {
        __caption__: 'Преподаватель',
        фИО: {
          __caption__: 'ФИО'
        }
      },
      задание: {
        __caption__: 'Задание',
        описание: {
          __caption__: 'Описание'
        }
      },
      бДМатериалов: {
        __caption__: 'материалы',
        материалы: {
          __caption__: 'Материалы',
          содержание: {
            __caption__: 'Содержание'
          }
        }
      }
    },
    КурсL: {
      iD: {
        __caption__: 'ID'
      },
      название: {
        __caption__: 'Название'
      },
      преподаватель: {
        __caption__: 'ФИО',
        фИО: {
          __caption__: 'ФИО'
        }
      },
      задание: {
        __caption__: 'Описание',
        описание: {
          __caption__: 'Описание'
        }
      }
    }
  },
  validations: {
    iD: {
      __caption__: 'ID'
    },
    название: {
      __caption__: 'Название'
    },
    задание: {
      __caption__: 'Задание'
    },
    преподаватель: {
      __caption__: 'Преподаватель'
    },
    бДМатериалов: {
      __caption__: 'материалы'
    }
  }
};
