export default {
  projections: {
    ЗаданиеE: {
      iD: {
        __caption__: 'ID'
      },
      описание: {
        __caption__: 'Описание'
      },
      срокСдачи: {
        __caption__: 'Срок сдачи'
      },
      заявка: {
        __caption__: 'Заявка',
        содержание: {
          __caption__: 'Содержание'
        }
      }
    },
    ЗаданиеL: {
      iD: {
        __caption__: 'ID'
      },
      описание: {
        __caption__: 'Описание'
      },
      срокСдачи: {
        __caption__: 'Срок сдачи'
      },
      заявка: {
        __caption__: 'Содержание',
        содержание: {
          __caption__: 'Содержание'
        }
      }
    }
  },
  validations: {
    iD: {
      __caption__: 'ID'
    },
    описание: {
      __caption__: 'Описание'
    },
    срокСдачи: {
      __caption__: 'Срок сдачи'
    },
    заявка: {
      __caption__: 'Заявка'
    }
  }
};
