export default {
  projections: {
    ЗаявкаE: {
      iD: {
        __caption__: 'ID'
      },
      содержание: {
        __caption__: 'Содержание'
      },
      датаСдачи: {
        __caption__: 'Дата сдачи'
      },
      студент: {
        __caption__: 'Студент',
        фИО: {
          __caption__: 'ФИО'
        }
      }
    },
    ЗаявкаL: {
      iD: {
        __caption__: 'ID'
      },
      содержание: {
        __caption__: 'Содержание'
      },
      датаСдачи: {
        __caption__: 'Дата сдачи'
      },
      студент: {
        __caption__: 'ФИО',
        фИО: {
          __caption__: 'ФИО'
        }
      }
    }
  },
  validations: {
    iD: {
      __caption__: 'ID'
    },
    датаСдачи: {
      __caption__: 'Дата сдачи'
    },
    содержание: {
      __caption__: 'Содержание'
    },
    студент: {
      __caption__: 'Студент'
    }
  }
};
